Repository: Aarontheissueguy/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/appdev.po
Languages: ca, tr

source: App development cookbook
ca: Receptari de desenvolupament d'aplicacions
tr: Uygulama geliştirme kitabı

source: Unofficial resources
ca: Recursos no oficials
tr: Gayri resmi kaynaklar

source: In this section you will find links to external resources about creating applications for Ubuntu Touch.
ca: A aquesta secció podeu trobar enllaços a a recursos externs sobre la creació d'aplicacions per a l'Ubuntu Touch.
tr: Bu bölümde, Ubuntu Touch uygulamaları oluşturmak için harici kaynaklara bağlantılar bulabilirsiniz.

source: `Ubuntu Touch programming book <https://www.gitbook.com/book/mimecar/ubuntu-touch-programming-course/details>`__
ca: «Llibre de programació de l'Ubuntu Touch <https://www.gitbook.com/book/mimecar/ubuntu-touch-programming-course/details>»__
tr: `Ubuntu Touch programla kitabı [İnglizce-English] <https://www.gitbook.com/book/mimecar/ubuntu-touch-programming-course/details>`__

source: Playground
ca: Zona de jocs
tr: Çalışma Alanı

source: In a completely free and open source community, it is natural to have community members exploring the limits of the platform in many many directions. In this section you will find links to external resources that do exactly that: Explore. The purpose of this list is to show the unlimited possibilities of an open platform like Ubuntu Touch.
ca: A una comunitat de codi completament obert i lliure, és natural que hi hagi membres de la comunitat explorant els límits de la plataforma en moltíssimes direccions. En aquesta secció podeu trobar enllaços a recursos externs que fan exactament això: Explorar. L'objectiu d'aquesta llista és mostrar les possibilitat il·limitades d'una plataforma oberta com l'Ubuntu Touch.
tr: Tamamen özgür ve açık kaynaklı bir toplulukta, toplum üyelerinin platformun sınırlarını birçok yönden keşfetmeleri doğaldır. Bu bölümde, tam olarak bunu yapan harici kaynaklara bağlantılar bulabilirsiniz: Keşfedin. Bu listenin amacı, Ubuntu Touch gibi açık bir platformun sınırsız olanaklarını göstermektir.

source: The resources listed here do not neccessarily represent the officially endorsed way of developing applications for Ubuntu Touch, but are interesting experiments.
ca: Els recursos que es llisten aquí no representen necessàriament la manera recomanada oficialment per desenvolupar aplicacions a l'Ubuntu Touch, però són experiments interessants.
tr: Burada listelenen kaynaklar, Ubuntu Touch uygulamaları için resmi olarak onaylanmış bir yöntem değildir; ilginç deneylerdir.

source: `Free Pascal development for Ubuntu Touch <http://kriscode.blogspot.tw/2016/09/freepascal-development-for-ubuntu-phone.html>`__
ca: «Desenvolupament lliure amb Pascal per a l'Ubuntu Touch <http://kriscode.blogspot.tw/2016/09/freepascal-development-for-ubuntu-phone.html>»__
tr: `Ubuntu Touch için Ücretsiz Pascal geliştirme <http://kriscode.blogspot.tw/2016/09/freepascal-development-for-ubuntu-phone.html>`__

source: `Lazarus development for Ubuntu Touch <http://kriscode.blogspot.tw/2016/10/lazarus-development-for-ubuntu-phone.html>`__
ca: «Desenvolupament amb Lazarus per a l'Ubuntu Touch <http://kriscode.blogspot.tw/2016/10/lazarus-development-for-ubuntu-phone.html>»__
tr: `Ubuntu Touch için Lazarus geliştime <http://kriscode.blogspot.tw/2016/10/lazarus-development-for-ubuntu-phone.html>`__

source: `Geany on Ubuntu Touch device as text editor, source code editor, debugger and compiler for multiple languages <http://kriscode.blogspot.tw/2017/10/geany-on-ubuntu-touch-device-as-text.html>`__
ca: «El Geany al dispositiu Ubuntu Touch com a editor de text, editor de codi font, depurador i compilador per a múltiples llenguatges <http://kriscode.blogspot.tw/2017/10/geany-on-ubuntu-touch-device-as-text.html>»__
tr: `Geany, Ubuntu Touch cihazında metin editörü, kaynak kod editörü, hata ayıklayıcı ve birden fazla dil için derleyici <http://kriscode.blogspot.tw/2017/10/geany-on-ubuntu-touch-device-as-text.html>`__

source: App development
ca: Desenvolupament d'aplicacions
tr: Uyguluma geliştime

source: Welcome to an open source and free platform under constant scrutiny and improvement by a vibrant global community, whose energy, connectedness, talent and commitment is unmatched. Ubuntu is also the third most deployed desktop OS in the world.
ca: Us donem la benvinguda a una plataforma de codi obert i lliura sota un control i un desenvolupament constants per part d'una comunitat vibrant global, l'energia, connectivitat i compromís de la qual no té parangons. L'Ubuntu és també el tercer sistema operatiu més distribuït al món.
tr: Enerji, bağlılık, yetenek ve bağlılığınız eşsiz olan canlı bir küresel topluluk tarafından sürekli olarak incelenip iyileştirilmekte olan açık kaynaklı ve ücretsiz bir platforma hoş geldiniz. Ubuntu, dünyanın en yaygın kullanılan üçüncü masaüstü işletim sistemidir.

source: Introduction
ca: Introducció
tr: Başlangıç

source: Clickable is a meta-build system for Ubuntu Touch applications that allows you to compile, build, test and publish `click <https://click.readthedocs.io/en/latest/>`_ packages. It is currently the easiest and most convenient way of building click packages for Ubuntu Touch.
ca: El Clickable és un sistema de meta-desenvolupament per a aplicacions de l'Ubuntu Touch que us permet compilar, muntar, comprovar i publicar paquets «click <https://click.readthedocs.io/en/latest/>». Actualment és la manera més fàcil i convenient de muntar paquets per a l'Ubuntu Touch.
tr: Clickable, Ubuntu Touch uygulamaları için derlemek, oluşturmak, test etmek ve yayınlamak için kullanılan bir meta oluşturucu sistemdir `tıkla <https://click.readthedocs.io/en/latest/>`_ paketler. Şu anda Ubuntu Touch için click paketleri oluşturmanın en kolay ve en kolay yolu.

source: See here for getting started `Read the Docs <http://clickable.bhdouglass.com/en/latest/>`_.
ca: Vegeu aquí per començar «Llegiu els documents <http://clickable.bhdouglass.com/en/latest/>».
tr: Başlamak için buraya bakın `Dökümanları Oku <http://clickable.bhdouglass.com/en/latest/>`_.

source: Ubuntu UI-Toolkit
ca: Joc d'eines de la interfície d'usuari de l'Ubuntu

source: Here you can find `the API documentation <https://api-docs.ubports.com/>`_ for the Ubuntu UI toolkit.
ca: Aquí podeu trobar la «documentació de la API <https://api-docs.ubports.com/>» per al joc d'eines de la interfície d'usuari de l'Ubuntu.
tr: Buradan `API dökümanını bulabilirsiniz ; <https://api-docs.ubports.com/>`_ Ubuntu UI toolkit için.

source: `Click packages <https://click.readthedocs.io/en/latest/>`__
ca: «Paquets Click<https://click.readthedocs.io/en/latest/>»
tr: `Click paketleri<https://click.readthedocs.io/en/latest/>`__

source: Ubuntu SDK IDE (unsupported)
ca: Ubuntu SDK IDE (sense suport)
tr: Ubuntu SDK IDE (desteklenmiyor)

source: The `Ubuntu SDK IDE <https://docs.ubuntu.com/phone/en/platform/sdk>`__ is no longer supported by Canonical, and UBports does not currently have the the time and manpower to get it to a working state.
ca: L'«Ubuntu SDK IDE <https://docs.ubuntu.com/phone/en/platform/sdk>» ja no té suport per part de Canonical, i l'UBports no té actualment el temps i els recursos humans per portar-lo a un estat funcional.
tr: `Ubuntu SDK IDE <https://docs.ubuntu.com/phone/en/platform/sdk>`__ artık Canonical tarafından desteklenmiyor ve UBports şu an için çalışma durumuna getirmek için zaman ve insan gücüne sahip değil.

source: It can still be installed in Ubuntu 16.04, but issues are expected.
ca: Encara es pot instal·lar a l'Ubuntu 16.04, però espereu problemes.
tr: Hâlâ Ubuntu 16.04'te kurulabilir, ancak sorunlar oluşacaktır.

source: Cookbook
ca: Receptari
tr: Kitap

source: A collection of external resources
ca: Una col·lecció de recursos externs
tr: Harici kaynaklardan oluşan bir koleksiyon
